Revit 2024 API
AssetProperty Class
 Represents a property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetProperty : IDisposable
Visual Basic
Public Class AssetProperty _
	Implements IDisposable
Visual C++
public ref class AssetProperty : IDisposable
Remarks
 AssetProperty is the base class or all other AssetProperty sub classes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetProperties
 Autodesk.Revit.DB.Visual.AssetPropertyBoolean
 Autodesk.Revit.DB.Visual.AssetPropertyDistance
 Autodesk.Revit.DB.Visual.AssetPropertyDouble
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleMatrix44
 Autodesk.Revit.DB.Visual.AssetPropertyEnum
 Autodesk.Revit.DB.Visual.AssetPropertyFloat
 Autodesk.Revit.DB.Visual.AssetPropertyFloatArray
 Autodesk.Revit.DB.Visual.AssetPropertyInt64
 Autodesk.Revit.DB.Visual.AssetPropertyInteger
 Autodesk.Revit.DB.Visual.AssetPropertyList
 Autodesk.Revit.DB.Visual.AssetPropertyReference
 Autodesk.Revit.DB.Visual.AssetPropertyString
 Autodesk.Revit.DB.Visual.AssetPropertyTime
 Autodesk.Revit.DB.Visual.AssetPropertyUInt64
See Also
AssetProperty Members
Autodesk.Revit.DB.Visual Namespace